АлогистикТест2/src/DataProcessors/алк_ЗагрузкаКубатурника/алк_ЗагрузкаКубатурника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_ЗагрузкаКубатурника</name>
</mdclass:DataProcessor>

АлогистикТест2/src/InformationRegisters/алк_КубатурникКруглогоЛеса/алк_КубатурникКруглогоЛеса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_КубатурникКруглогоЛеса</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДлинаМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СечениеМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКубатурника</name>
    <type>
      <types>EnumRef.алк_ТипыКубатурников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Enums/алк_ТипыКубатурников/алк_ТипыКубатурников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ТипыКубатурников</name>
  <enumValues>
    <name>ГОСТ_270875</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/DataProcessors/алк_ЗагрузкаКубатурника/Forms/Форма/Module.bsl
&НаСервере
Перем Таблица;

&НаСервере
Процедура ПрочитатьФайлНаСервере()
	
	// чтение файла
	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	
	Попытка
		ЗагружаемыйФайл.Прочитать(ИмяФайлаЗагрузки);
	Исключение
		Ош = ОписаниеОшибки();
		Возврат;
	КонецПопытки;
	
	
	Таблица = Новый ТаблицаЗначений;
	
	Шапка = ЗагружаемыйФайл.ПолучитьСтроку(1);
	
	//раскладываем строку в массив
	МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Шапка, ";");
	
	//генерируем колонки
	НомерКолонкиЧисло = 0;
	Для Каждого ИмяКолонки Из МассивКолонок Цикл
		
		ИмяБезПробелов = СтрЗаменить(ИмяКолонки, " ",""); 
		ИмяБезПробелов = СтрЗаменить(ИмяБезПробелов, ".","_"); 		
		ИмяБезПробелов = СокрЛП(ИмяБезПробелов);
		ИмяБезПробелов = "Д_" + Строка(ИмяБезПробелов);
		
		МассивТипов = Новый Массив;
		//МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
		МассивТипов.Добавить(Тип("Строка"));
		ПараметрыСтроки = Новый КвалификаторыСтроки(100);
		
		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , ПараметрыСтроки);
		
		Таблица.Колонки.Добавить(ИмяБезПробелов, ДопустимыеТипы, ИмяКолонки);
		
	КонецЦикла;
	
	Для НомерСтроки = 3 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
		//ОбработкаПрерыванияПользователя();
		
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка, ";");
		НоваяСтрока = Таблица.Добавить();
		
		Если МассивКолонок.Количество() <> Таблица.Колонки.Количество() Тогда
			// Сообщить("Ошибка со строкой " + Строка);
			Продолжить; // скорее всего в тексте содержит разделитель
		КонецЕсли;
		
		Для НомерКолонки = 1 по МассивКолонок.Количество() Цикл
			//заполняем строку значениями
			ТекущееЗначение = МассивКолонок[НомерКолонки-1];
			ИмяКолонки = Таблица.Колонки[НомерКолонки-1].Имя;
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;
		КонецЦикла;
		
		
	КонецЦикла;
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РезультатЗагрузкиФайла"));
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		
		НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.РезультатЗагрузкиФайла);       
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "РезультатЗагрузкиФайла." + Колонка.Имя;
		НовыйЭлемент.Ширина = 10;
		
	КонецЦикла;
	
	
	ТекущийТип = Перечисления.алк_ТипыКубатурников.ГОСТ_270875;
	
	Для каждого стрТаблицы Из Таблица Цикл
		
		Длина = Число(стрТаблицы[0])/100;
		
		Для каждого Колонка Из Таблица.Колонки Цикл
			Если Колонка = Таблица.Колонки[0] ИЛИ Колонка = Таблица.Колонки[Таблица.Колонки.Количество()-1] Тогда
				Продолжить;	
			КонецЕсли; 			
			Диаметр = Число(Прав(Колонка.Имя, СтрДлина(Колонка.Имя)-2))/100;
			
			
			Объем = ?(стрТаблицы[Колонка.Имя] = "", "0", стрТаблицы[Колонка.Имя]);
			ОбъемЧисло = Число(Объем)/10000;
			
			
			Если ОбъемЧисло > 0 Тогда
				
				НаборЗаписей = РегистрыСведений.алк_КубатурникКруглогоЛеса.СоздатьНаборЗаписей();
				
				
				НаборЗаписей.Отбор.ДлинаМ.Установить(Длина);
				НаборЗаписей.Отбор.СечениеМ.Установить(Диаметр);
				НаборЗаписей.Отбор.ТипКубатурника.Установить(ТекущийТип);
				
				НоваяЗапись = НаборЗаписей.Добавить();
				
				НоваяЗапись.ДлинаМ          = Длина;
				НоваяЗапись.СечениеМ        = Диаметр;
				НоваяЗапись.ТипКубатурника = ТекущийТип;
				
				НоваяЗапись.Объем          = ОбъемЧисло;
				
				Попытка
					НаборЗаписей.Записать();
				Исключение
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Строка регистра не записана! " + ОписаниеОшибки();
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(Таблица, РезультатЗагрузкиФайла);
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ПрочитатьФайлНаСервере();
КонецПроцедуры



#Область ОбработчикиСобытийЭлементовФормы


&НаКлиенте
Процедура ИмяФайлаЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораФайла(СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНачалоВыбораФайла(СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//РежимДиалога = ?(РежимВыгрузки, РежимДиалогаВыбораФайла.Сохранение, РежимДиалогаВыбораФайла.Открытие);
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Выберите файл с данными сортировки'");
	//ДиалогВыбораФайла.ПолноеИмяФайла = ?(РежимВыгрузки, ИмяФайлаВыгрузки, ИмяФайлаЗагрузки);	
	ДиалогВыбораФайла.ПолноеИмяФайла = ИмяФайлаЗагрузки;
	ДиалогВыбораФайла.Фильтр = "Формат загрузки(*.csv)|*.csv|Все файлы (*.*)|*.*";
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ИмяФайлаЗагрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
